jm-report/statistics.json
{
  "POST Rent Car" : {
    "transaction" : "POST Rent Car",
    "sampleCount" : 150,
    "errorCount" : 150,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 30.80082135523614,
    "receivedKBytesPerSec" : 35.85668794917864,
    "sentKBytesPerSec" : 0.0
  },
  "GET All Cars" : {
    "transaction" : "GET All Cars",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.4739999999999998,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 42.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.990000000000009,
    "throughput" : 50.70479667376534,
    "receivedKBytesPerSec" : 8.61585412229997,
    "sentKBytesPerSec" : 8.813919734306864
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 710,
    "errorCount" : 210,
    "errorPct" : 29.577465,
    "meanResTime" : 1.038028169014085,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 42.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 71.99351044412899,
    "receivedKBytesPerSec" : 33.42929299330765,
    "sentKBytesPerSec" : 8.813026008923138
  },
  "POST Return Car" : {
    "transaction" : "POST Return Car",
    "sampleCount" : 60,
    "errorCount" : 60,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 20.869565217391305,
    "receivedKBytesPerSec" : 24.381453804347824,
    "sentKBytesPerSec" : 0.0
  }
}